In [1]:
import pandas as pd
import numpy as np


d2 = {'Name':['Alice', 'Betty', 'Cathy', 'Dorothy', 'Emily'],
      'Age':[11, 23, 34, 42, 50], 
      'Height': [140, 159, 166, 170, 182], 
      'Weight': [35, 58, 64, 68, 70]}
df2 = pd.DataFrame(d2)

# Дополнительные возможности loc и iloc

## Доступ к данным (loc и iloc + булев массив)

In [2]:
df7=df2.copy()
df7

      Name  Age  Height  Weight
0    Alice   11     140      35
1    Betty   23     159      58
2    Cathy   34     166      64
3  Dorothy   42     170      68
4    Emily   50     182      70

In [3]:
# В переменной 'a' содержится массив из пяти элементов (в соответствии с количеством строк датафрейма df7)
a=[True, False, True, False, True]
# В переменной 'b' содержится массив из четырех элементов (в соответствии с количеством столбцов датафрейма df7)
b=[True, False, False, True]

In [4]:
# используем метод loc c булевыми массивами
df7.loc[a, b]

    Name  Weight
0  Alice      35
2  Cathy      64
4  Emily      70

In [5]:
# используем метод iloc c булевыми массивами
df7.iloc[a, b]

    Name  Weight
0  Alice      35
2  Cathy      64
4  Emily      70

In [6]:
# фильтруем только столбцы с помощью loc и булева массива 
# соответсвует записи df7.loc[:,b]

df7.loc[:,[True, False, False, True]]

      Name  Weight
0    Alice      35
1    Betty      58
2    Cathy      64
3  Dorothy      68
4    Emily      70

In [7]:
# фильтруем только строки с помощью iloc и булева массива 
# соответсвует записи df7.iloc[a]

df7.iloc[[True, False, True, False, True]]

    Name  Age  Height  Weight
0  Alice   11     140      35
2  Cathy   34     166      64
4  Emily   50     182      70

# Возможность изменения структуры

## Пример 1.1

In [8]:
df8=df2.copy()
df8

      Name  Age  Height  Weight
0    Alice   11     140      35
1    Betty   23     159      58
2    Cathy   34     166      64
3  Dorothy   42     170      68
4    Emily   50     182      70

In [9]:
df8.loc[2,'Weight']

64

In [10]:
df8.loc[2,'Weight']=66
df8

      Name  Age  Height  Weight
0    Alice   11     140      35
1    Betty   23     159      58
2    Cathy   34     166      66
3  Dorothy   42     170      68
4    Emily   50     182      70

In [11]:
# мы также можем использовать iloc для изменения структуры, используя для доступа к данным целочисленные позиции элементов
df8_2=df2.copy()
df8_2.iloc[2, 3]=66
df8_2

      Name  Age  Height  Weight
0    Alice   11     140      35
1    Betty   23     159      58
2    Cathy   34     166      66
3  Dorothy   42     170      68
4    Emily   50     182      70

## Пример 1.2

In [12]:
df8.loc[5]=['Felicity', 56, 183, 75]
df8

       Name  Age  Height  Weight
0     Alice   11     140      35
1     Betty   23     159      58
2     Cathy   34     166      66
3   Dorothy   42     170      68
4     Emily   50     182      70
5  Felicity   56     183      75

In [13]:
df8.loc[6,'Name']='Grace'
df8

       Name   Age  Height  Weight
0     Alice  11.0   140.0    35.0
1     Betty  23.0   159.0    58.0
2     Cathy  34.0   166.0    66.0
3   Dorothy  42.0   170.0    68.0
4     Emily  50.0   182.0    70.0
5  Felicity  56.0   183.0    75.0
6     Grace   NaN     NaN     NaN

## Пример 2

In [14]:
df9=df2.copy()
df9

      Name  Age  Height  Weight
0    Alice   11     140      35
1    Betty   23     159      58
2    Cathy   34     166      64
3  Dorothy   42     170      68
4    Emily   50     182      70

In [15]:
df9.loc[:,'Weight']-1

0    34
1    57
2    63
3    67
4    69
Name: Weight, dtype: int64

In [16]:
# если не присвоить результат вычисления соответствующей колонке, то датафрейм df9 останется прежним
df9

      Name  Age  Height  Weight
0    Alice   11     140      35
1    Betty   23     159      58
2    Cathy   34     166      64
3  Dorothy   42     170      68
4    Emily   50     182      70

In [17]:
# присваиваем результат вычисления соотвествующей колонке датафрейма df9
df9.loc[:,'Weight']=df9['Weight']-1
df9

      Name  Age  Height  Weight
0    Alice   11     140      34
1    Betty   23     159      57
2    Cathy   34     166      63
3  Dorothy   42     170      67
4    Emily   50     182      69

## Пример 3.1

#### Индекс массы тела (ИМТ) - body mass index (BMI)
#### Для вычислений необходимо взять вес в килограммах и разделить на рост в метрах, возведенный в квадрат.

In [18]:
# мы одновременно создаем колонку и производим вычисления, чтобы заполнить эту колонку значениями
df10=df9.copy()
df10.loc[:, 'BMI'] = (df10['Weight']/((df10['Height']/100)**2)).round(1)
df10

      Name  Age  Height  Weight   BMI
0    Alice   11     140      34  17.3
1    Betty   23     159      57  22.5
2    Cathy   34     166      63  22.9
3  Dorothy   42     170      67  23.2
4    Emily   50     182      69  20.8

## Пример 3.2

In [19]:
df10_2=df9.copy()
df10_2['BMI'] = (df10_2['Weight']/((df10_2['Height']/100)**2)).round(1)
df10_2

      Name  Age  Height  Weight   BMI
0    Alice   11     140      34  17.3
1    Betty   23     159      57  22.5
2    Cathy   34     166      63  22.9
3  Dorothy   42     170      67  23.2
4    Emily   50     182      69  20.8

### SettingWithCopyWarning

In [20]:
df10_3=df9.copy()
df10_3['Name'][3]='Diana'
df10_3

C:\Users\iaasm\AppData\Local\Temp\ipykernel_13320\2360528682.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df10_3['Name'][3]='Diana'

    Name  Age  Height  Weight
0  Alice   11     140      34
1  Betty   23     159      57
2  Cathy   34     166      63
3  Diana   42     170      67
4  Emily   50     182      69

In [21]:
df10_4=df9.copy()
df10_4.loc[3,'Name']='Diana'
df10_4

    Name  Age  Height  Weight
0  Alice   11     140      34
1  Betty   23     159      57
2  Cathy   34     166      63
3  Diana   42     170      67
4  Emily   50     182      69

# Возможность одновременного поиска и создания колонки по условию

In [22]:
# Пример поиска по условию и одновременного создания колонки со значениями через loc
# Сначала создаем копию датафрейма df2 - df11
df11=df2.copy()
df11

      Name  Age  Height  Weight
0    Alice   11     140      35
1    Betty   23     159      58
2    Cathy   34     166      64
3  Dorothy   42     170      68
4    Emily   50     182      70

In [23]:
# Ищем все строки, где возраст менее 18 лет, добавляем новую колонку 'Child' и сразу присваиваем значение 1:
df11.loc[df11['Age']<18, 'Child']=1
df11

      Name  Age  Height  Weight  Child
0    Alice   11     140      35    1.0
1    Betty   23     159      58    NaN
2    Cathy   34     166      64    NaN
3  Dorothy   42     170      68    NaN
4    Emily   50     182      70    NaN

In [24]:
df11['Child'].dtype

dtype('float64')

In [25]:
# incompatible dtype
df12=df2.copy()
df12.loc[df12['Age']<18, 'Child']='yes'
df12

      Name  Age  Height  Weight Child
0    Alice   11     140      35   yes
1    Betty   23     159      58   nan
2    Cathy   34     166      64   nan
3  Dorothy   42     170      68   nan
4    Emily   50     182      70   nan

In [26]:
df13=df2.copy()
df13.loc[:, 'Child']=None
df13

      Name  Age  Height  Weight Child
0    Alice   11     140      35  None
1    Betty   23     159      58  None
2    Cathy   34     166      64  None
3  Dorothy   42     170      68  None
4    Emily   50     182      70  None

In [27]:
df13['Child']

0    None
1    None
2    None
3    None
4    None
Name: Child, dtype: object

In [28]:
df13['Child'].dtype

dtype('O')

In [29]:
df13.loc[df13['Age']<18, 'Child']='yes'
df13

      Name  Age  Height  Weight Child
0    Alice   11     140      35   yes
1    Betty   23     159      58  None
2    Cathy   34     166      64  None
3  Dorothy   42     170      68  None
4    Emily   50     182      70  None

In [30]:
# для красоты заменим все отсутсвующие значения в колонке 'Child' на 'no':
df13['Child'].fillna('no', inplace=True)
df13

      Name  Age  Height  Weight Child
0    Alice   11     140      35   yes
1    Betty   23     159      58    no
2    Cathy   34     166      64    no
3  Dorothy   42     170      68    no
4    Emily   50     182      70    no

# Другие методы pandas

In [31]:
df14=df2.copy()
df14['Child'] = np.where(df14['Age'] < 18, 'yes', 'no')
df14

      Name  Age  Height  Weight Child
0    Alice   11     140      35   yes
1    Betty   23     159      58    no
2    Cathy   34     166      64    no
3  Dorothy   42     170      68    no
4    Emily   50     182      70    no

In [32]:
df15=df2.copy()
df15['Age_category'] = pd.cut(df15['Age'], [0,18,120], labels=['child', 'adult'], right=False)
df15

      Name  Age  Height  Weight Age_category
0    Alice   11     140      35        child
1    Betty   23     159      58        adult
2    Cathy   34     166      64        adult
3  Dorothy   42     170      68        adult
4    Emily   50     182      70        adult